<a href="https://colab.research.google.com/github/norvin2002/coding101-start/blob/master/Sample_Code_Data_Science_101_Session_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Import Pandas

In [ ]:
import pandas as pd

Create a DataFrame with List of Lists

In [ ]:
import pandas as pd
data = [
        ['Alex',20,1050],
        ['Bob',52,1400],
        ['Cat',23,1690]
]

df = pd.DataFrame(data,columns = ['name','age','salary'])

df

   name  age  salary
0  Alex   20    1050
1   Bob   52    1400
2   Cat   23    1690

Create a DataFrame with List of Dictionaries

In [ ]:
import pandas as pd
data = [
        {'name':'Alex','age':20,'salary':1050},
        {'name':'Bob','age':52,'salary':1400},
        {'name':'Cat','age':23,'salary':1690}
]

df = pd.DataFrame(data,columns = ['name','age','salary'])

df

   name  age  salary
0  Alex   20    1050
1   Bob   52    1400
2   Cat   23    1690

Extracting Row from DataFrame

In [ ]:
import pandas as pd
data = [
        {'name':'Alex','age':20,'salary':1050},
        {'name':'Bob','age':52,'salary':1400},
        {'name':'Cat','age':23,'salary':1690}
]

df = pd.DataFrame(data,columns = ['name','age','salary'])

df.loc[0]

name      Alex
age         20
salary    1050
Name: 0, dtype: object

Extracting Column from DataFrame

In [ ]:
import pandas as pd
data = [
        {'name':'Alex','age':20,'salary':1050},
        {'name':'Bob','age':52,'salary':1400},
        {'name':'Cat','age':23,'salary':1690}
]

df = pd.DataFrame(data,columns = ['name','age','salary'])

df['name']

0    Alex
1     Bob
2     Cat
Name: name, dtype: object

Upload a file to Google Colab

In [ ]:
from google.colab import files
uploaded = files.upload()

Saving unit05-data.csv to unit05-data.csv

Using read_csv() to Print Data

In [ ]:
import pandas as pd
pd.read_csv('unit05-data.csv')

          country  ... Estimated incidence (all forms) per 100 000 population
0     Afghanistan  ...                                              190.0
1     Afghanistan  ...                                              189.0
2     Afghanistan  ...                                              189.0
3     Afghanistan  ...                                              189.0
4     Afghanistan  ...                                              189.0
...           ...  ...                                                ...
3646     Zimbabwe  ...                                              355.0
3647     Zimbabwe  ...                                              304.0
3648     Zimbabwe  ...                                              278.0
3649     Zimbabwe  ...                                              242.0
3650     Zimbabwe  ...                                              208.0

[3651 rows x 7 columns]

Extracting data in DataFrame

In [ ]:
import pandas as pd
df = pd.read_csv('unit05-data.csv')

sg = df[(df['country'] == 'Singapore')]
sg['Estimated incidence (all forms) per 100 000 population'].sum()

700.0

Demo 14

In [ ]:
import pandas as pd
df = pd.read_csv('unit05-data.csv')

#part 1
year = df[ (df['year'] == 2008)]
print(year['Estimated incidence (all forms) per 100 000 population'].sum())

#part 2
zimbabwe = df[ (df['country'] == 'Zimbabwe')]
print(zimbabwe['Estimated incidence (all forms) per 100 000 population'].sum())

27636.8
7863.0

read_json()

In [ ]:
import pandas as pd

json_str= '{"country":"Netherlands","timezone":"Europe\/Amsterdam","ip":"46.19.37.108","continent_code":"EU","longitude":5.75,"latitude":52.5,"country_code":"NL"}'
data = pd.read_json(json_str, typ = "series")
print("Series\n", data)

Series
 country                Netherlands
timezone          Europe/Amsterdam
ip                    46.19.37.108
continent_code                  EU
longitude                     5.75
latitude                      52.5
country_code                    NL
dtype: object

In [ ]:
Importing JSON files

In [ ]:
from google.colab import files
uploaded = files.upload()

Saving example_1.json to example_1.json

In [ ]:
import pandas as pd
df = pd.read_json('example_1.json', typ ='series')

df

fruit    Apple
size     Large
color      Red
dtype: object

Demo 15

In [ ]:
import pandas as pd

json_str= '{"firstName":"Mona","lastName":"Tan","nationality":"Singapore"}'
data = pd.read_json(json_str, typ = "series")
print("My Info\n", data)

My Info
 firstName           Mona
lastName             Tan
nationality    Singapore
dtype: object

Excel in Pandas

In [ ]:
from google.colab import files
uploaded = files.upload()

Saving unit05_data.xls to unit05_data.xls

In [ ]:
import pandas as pd
df = pd.read_excel('unit05_data.xls',typ = 'series')
df

   0 First Name  Last Name  Gender        Country  Age        Date    Id
0  1      Dulce      Abril  Female  United States   32  15/10/2017  1562
1  2       Mara  Hashimoto  Female  Great Britain   25  16/08/2016  1582
2  3     Philip       Gent    Male         France   36  21/05/2015  2587
3  4   Kathleen     Hanner  Female  United States   25  15/10/2017  3549
4  5    Nereida    Magwood  Female  United States   58  16/08/2016  2468
5  6     Gaston      Brumm    Male  United States   24  21/05/2015  2554
6  7       Etta       Hurn  Female  Great Britain   56  15/10/2017  3598
7  8    Earlean     Melgar  Female  United States   27  16/08/2016  2456
8  9   Vincenza    Weiland  Female  United States   40  21/05/2015  6548

Extracting data from xls file on Dataframe

In [ ]:
import pandas as pd
df = pd.read_excel('unit05_data.xls',typ = 'series')

gender_and_country = df[(df['Gender']=='Female') & (df['Country']== "United States")]
gender_and_country

   0 First Name Last Name  Gender        Country  Age        Date    Id
0  1      Dulce     Abril  Female  United States   32  15/10/2017  1562
3  4   Kathleen    Hanner  Female  United States   25  15/10/2017  3549
4  5    Nereida   Magwood  Female  United States   58  16/08/2016  2468
7  8    Earlean    Melgar  Female  United States   27  16/08/2016  2456
8  9   Vincenza   Weiland  Female  United States   40  21/05/2015  6548

Demo 16

In [ ]:
from google.colab import files
uploaded = files.upload()

Saving Unit05-Demo53.xls to Unit05-Demo53.xls

In [ ]:
import pandas as pd
df = pd.read_excel ('Unit05-Demo53.xls',typ='series')
age_and_date =  df[ (df['Age'] >= 25) & (df['Date'] == '21/05/2015') ] 
age_and_date['First Name'].count()

33

XML in Python

In [ ]:
from google.colab import files
uploaded = files.upload()

Saving Unit 05 - XML Sample Data.xml to Unit 05 - XML Sample Data.xml

In [ ]:
import xml.etree.ElementTree as ET

tree = ET.parse("Unit 05 - XML Sample Data.xml")
root = tree.getroot()
for child in root:
  print(child.tag , child.attrib)

country {'name': 'Liechtenstein'}
country {'name': 'Singapore'}
country {'name': 'Panama'}

XML in Pandas

In [ ]:
#parsing xml file and storing in Dataframe
import xml.etree.ElementTree as ET
import pandas as pd

tree = ET.parse("Unit 05 - XML Sample Data.xml")

dfcols = ["Country", "rank", "year", "GDP"]
df_xml = pd.DataFrame(columns = dfcols)

for node in tree.getroot():
    name = node.attrib.get("name")
    rank = node.find("rank").text
    y = node.find("year").text
    gdppc = node.find("gdppc").text
    df_xml = df_xml.append(pd.Series([name,rank,y,gdppc], index = dfcols),ignore_index = True)

df_xml

         Country rank  year     GDP
0  Liechtenstein    1  2008  141100
1      Singapore    4  2011   59900
2         Panama   68  2011   13600

In [ ]:
from google.colab import files
uploaded = files.upload()

Saving breakfast_menu.xml to breakfast_menu.xml

In [ ]:
import pandas as pd
import xml.etree.ElementTree as ET
tree = ET.parse('breakfast_menu.xml')

dfcols = ["food", "price", "description", 'calories']
df_xml = pd.DataFrame(columns=dfcols)


for node in tree.getroot():
    name = node.find('name').text
    price = node.find('price').text
    description = node.find('description').text
    calories = node.find('calories').text
    
    df_xml = df_xml.append( pd.Series([name , price, description, calories],index=dfcols) , ignore_index =True)
    
df_xml

                          food  ... calories
0              Belgian Waffles  ...      650
1   Strawberry Belgian Waffles  ...      900
2  Berry-Berry Belgian Waffles  ...      900
3                 French Toast  ...      600
4          Homestyle Breakfast  ...      950

[5 rows x 4 columns]

Missing Data

In [ ]:
import pandas as pd
df = pd.read_excel("MissingData.xls",typ = "series")
df = df.dropna()
df

    0 First Name  Last Name  Gender        Country   Age        Date    Id
0   1      Dulce      Abril  Female  United States  32.0  15/10/2017  1562
1   2       Mara  Hashimoto  Female  Great Britain  25.0  16/08/2016  1582
5   6     Gaston      Brumm    Male  United States  24.0  21/05/2015  2554
6   7       Etta       Hurn  Female  Great Britain  56.0  15/10/2017  3598
7   8    Earlean     Melgar  Female  United States  27.0  16/08/2016  2456
8   9   Vincenza    Weiland  Female  United States  40.0  21/05/2015  6548
9  10     Fallon    Winward  Female  Great Britain  28.0  16/08/2016  5486

Data Imputation

In [ ]:
import pandas as pd
df = pd.read_excel("MissingData.xls",typ = "series")
df["Age"] = df["Age"].fillna(0)
df

    0 First Name  Last Name  Gender        Country   Age        Date    Id
0   1      Dulce      Abril  Female  United States  32.0  15/10/2017  1562
1   2       Mara  Hashimoto  Female  Great Britain  25.0  16/08/2016  1582
2   3     Philip       Gent    Male         France   0.0  21/05/2015  2587
3   4   Kathleen     Hanner  Female  United States   0.0  15/10/2017  3549
4   5    Nereida    Magwood  Female  United States   0.0  16/08/2016  2468
5   6     Gaston      Brumm    Male  United States  24.0  21/05/2015  2554
6   7       Etta       Hurn  Female  Great Britain  56.0  15/10/2017  3598
7   8    Earlean     Melgar  Female  United States  27.0  16/08/2016  2456
8   9   Vincenza    Weiland  Female  United States  40.0  21/05/2015  6548
9  10     Fallon    Winward  Female  Great Britain  28.0  16/08/2016  5486

Grouping & Aggregation

In [ ]:
import pandas as pd
student = ["Anna","Bob","Cass","Darius","Eugene","Felica","Gordon"]
classroom = ["A","A","B","A","B","B","B"]
age = [15,15,16,17,15,18,15]
score =  [80,82,95,70,67,98,85]
data = {"Student": student, "Class":classroom, "Age": age,"Score": score}
df = pd.DataFrame(data)
df

  Student Class  Age  Score
0    Anna     A   15     80
1     Bob     A   15     82
2    Cass     B   16     95
3  Darius     A   17     70
4  Eugene     B   15     67
5  Felica     B   18     98
6  Gordon     B   15     85

In [ ]:
import pandas as pd
student = ["Anna","Bob","Cass","Darius","Eugene","Felica","Gordon"]
classroom = ["A","A","B","A","B","B","B"]
age = [15,15,16,17,15,18,15]
score =  [80,82,95,70,67,98,85]
data = {"Student": student, "Class":classroom, "Age": age,"Score": score}
df = pd.DataFrame(data)
class_score = df.groupby('Class').agg({'Score': ['mean', 'min', 'max']})
class_score

           Score
            mean min max
Class
A      77.333333  70  82
B      86.250000  67  98

Grouping by Multiple Columns

In [ ]:
import pandas as pd
student = ["Anna","Bob","Cass","Darius","Eugene","Felica","Gordon"]
classroom = ["A","A","B","A","B","B","B"]
age = [15,15,16,17,15,18,15]
score =  [80,82,95,70,67,98,85]
data = {"Student": student, "Class":classroom, "Age": age,"Score": score}
df = pd.DataFrame(data)
class_score = df.groupby(['Class','Age']).agg({'Score': ['mean', 'min', 'max']})
class_score

          Score
           mean min max
Class Age
A     15     81  80  82
      17     70  70  70
B     15     76  67  85
      16     95  95  95
      18     98  98  98

Filtering: Select Rows Based on Value of Column

In [ ]:
import pandas as pd
df = pd.read_csv('unit05-data.csv')

year_2002 = df[ (df['year'] == 2002)]
year_2002

                        country  ... Estimated incidence (all forms) per 100 000 population
2                   Afghanistan  ...                                              189.0
19                      Albania  ...                                               22.0
36                      Algeria  ...                                               74.0
53               American Samoa  ...                                                3.9
70                      Andorra  ...                                                8.2
...                         ...  ...                                                ...
3568  Wallis and Futuna Islands  ...                                              149.0
3585   West Bank and Gaza Strip  ...                                                1.9
3602                      Yemen  ...                                              102.0
3619                     Zambia  ...                                              695.0
3636                   Zimbabwe  ...                                              617.0

[213 rows x 7 columns]

Select Rows Whose Column Value Does NOT Equal a Specific Value

In [ ]:
import pandas as pd
df = pd.read_csv('unit05-data.csv')

year_not_2002 = df[ (df['year'] != 2002)]
year_not_2002

          country  ... Estimated incidence (all forms) per 100 000 population
0     Afghanistan  ...                                              190.0
1     Afghanistan  ...                                              189.0
3     Afghanistan  ...                                              189.0
4     Afghanistan  ...                                              189.0
5     Afghanistan  ...                                              189.0
...           ...  ...                                                ...
3646     Zimbabwe  ...                                              355.0
3647     Zimbabwe  ...                                              304.0
3648     Zimbabwe  ...                                              278.0
3649     Zimbabwe  ...                                              242.0
3650     Zimbabwe  ...                                              208.0

[3438 rows x 7 columns]

Select Not Null

In [ ]:
import pandas as pd
df = pd.read_csv('unit05-data.csv')
df_not_null = df[df.year.notnull()]
df_not_null

          country  ... Estimated incidence (all forms) per 100 000 population
0     Afghanistan  ...                                              190.0
1     Afghanistan  ...                                              189.0
2     Afghanistan  ...                                              189.0
3     Afghanistan  ...                                              189.0
4     Afghanistan  ...                                              189.0
...           ...  ...                                                ...
3646     Zimbabwe  ...                                              355.0
3647     Zimbabwe  ...                                              304.0
3648     Zimbabwe  ...                                              278.0
3649     Zimbabwe  ...                                              242.0
3650     Zimbabwe  ...                                              208.0

[3651 rows x 7 columns]

Select a list of years

In [ ]:
import pandas as pd
df = pd.read_csv('unit05-data.csv')

years = [2002,2008]
selection = df[df.year.isin(years)]

selection

          country  ... Estimated incidence (all forms) per 100 000 population
2     Afghanistan  ...                                              189.0
8     Afghanistan  ...                                              189.0
19        Albania  ...                                               22.0
25        Albania  ...                                               16.0
36        Algeria  ...                                               74.0
...           ...  ...                                                ...
3608        Yemen  ...                                               60.0
3619       Zambia  ...                                              695.0
3625       Zambia  ...                                              534.0
3636     Zimbabwe  ...                                              617.0
3642     Zimbabwe  ...                                              487.0

[427 rows x 7 columns]

Select Rows Based on Values Not in List

In [ ]:
import pandas as pd
df = pd.read_csv('unit05-data.csv')

years = [2002,2008]
selection = df[~df.year.isin(years)]

selection

          country  ... Estimated incidence (all forms) per 100 000 population
0     Afghanistan  ...                                              190.0
1     Afghanistan  ...                                              189.0
3     Afghanistan  ...                                              189.0
4     Afghanistan  ...                                              189.0
5     Afghanistan  ...                                              189.0
...           ...  ...                                                ...
3646     Zimbabwe  ...                                              355.0
3647     Zimbabwe  ...                                              304.0
3648     Zimbabwe  ...                                              278.0
3649     Zimbabwe  ...                                              242.0
3650     Zimbabwe  ...                                              208.0

[3224 rows x 7 columns]

Select Rows Using Multiple Conditions

In [ ]:
import pandas as pd
df = pd.read_csv('unit05-data.csv')

years = [2002,2008]
country = ["Singapore"]
selection = df[df.year.isin(years) & df.country.isin(country)]

selection

        country  ... Estimated incidence (all forms) per 100 000 population
2894  Singapore  ...                                               42.0
2900  Singapore  ...                                               37.0

[2 rows x 7 columns]

Concatenate DataFrames by Rows

In [ ]:
import pandas as pd
student1 = ["Anna","Bob","Cass","Darius","Eugene","Felica","Gordon"]
classroom1 = ["A","A","B","A","B","B","B"]
age1 = [15,15,16,17,15,18,15]
score1 =  [80,82,95,70,67,98,85]
data1 = {"Student": student1, "Class":classroom1, "Age": age1,"Score": score1}
df1 = pd.DataFrame(data1)

student2 = ["Charlie","James","Ethan"]
classroom2 = ["C","C","C"]
age2 = [16,17,18]
score2 = [95,77,80]
data2 = {"Student": student2, "Class":classroom2, "Age": age2,"Score": score2}
df2 = pd.DataFrame(data2)

df_row = pd.concat([df1, df2], ignore_index=True)
df_row

   Student Class  Age  Score
0     Anna     A   15     80
1      Bob     A   15     82
2     Cass     B   16     95
3   Darius     A   17     70
4   Eugene     B   15     67
5   Felica     B   18     98
6   Gordon     B   15     85
7  Charlie     C   16     95
8    James     C   17     77
9    Ethan     C   18     80

Concatenate by Column

In [ ]:
import pandas as pd
student1 = ["Anna","Bob","Cass","Darius","Eugene","Felica","Gordon"]
classroom1 = ["A","A","B","A","B","B","B"]
age1 = [15,15,16,17,15,18,15]
score1 =  [80,82,95,70,67,98,85]
data1 = {"Student": student1, "Class":classroom1, "Age": age1,"Score": score1}
df1 = pd.DataFrame(data1)

student2 = ["Charlie","James","Ethan"]
classroom2 = ["C","C","C"]
age2 = [16,17,18]
score2 = [95,77,80]
data2 = {"Student": student2, "Class":classroom2, "Age": age2,"Score": score2}
df2 = pd.DataFrame(data2)

df_row = pd.concat([df1, df2], ignore_index=True,axis=1)
df_row

        0  1   2   3        4    5     6     7
0    Anna  A  15  80  Charlie    C  16.0  95.0
1     Bob  A  15  82    James    C  17.0  77.0
2    Cass  B  16  95    Ethan    C  18.0  80.0
3  Darius  A  17  70      NaN  NaN   NaN   NaN
4  Eugene  B  15  67      NaN  NaN   NaN   NaN
5  Felica  B  18  98      NaN  NaN   NaN   NaN
6  Gordon  B  15  85      NaN  NaN   NaN   NaN

Merge DataFrames

In [ ]:
import pandas as pd
student1 = ["Anna","Bob","Cass","Darius","Eugene","Felica","Gordon"]
classroom1 = ["A","A","B","A","B","B","B"]
age1 = [15,15,16,17,15,18,15]
score1 =  [80,82,95,70,67,98,85]
data1 = {"Student": student1, "Class":classroom1, "Age": age1,"Score": score1}
df1 = pd.DataFrame(data1,columns = ['Student', 'Class', 'Age', 'Score'])

student2 = ["Charlie","James","Ethan"]
classroom2 = ["C","C","C"]
age2 = [16,17,18]
score2 = [95,77,80]
data2 = {"Student": student2, "Class":classroom2, "Age": age2,"Score": score2}
df2 = pd.DataFrame(data2, columns = ['Student', 'Class', 'Age', 'Score'])

df_row = pd.concat([df1, df2], ignore_index=True)
student3 = ["Anna","Bob","Cass","Darius","Eugene","Felica","Gordon","Charlie","James","Ethan"]
id3 = [1,2,3,4,5,6,7,8,9,10]

data3 = {"Student":student3, "id":id3}
df3 = pd.DataFrame(data3,columns = ['Student', 'id'])

df_merge_col = pd.merge(df_row, df3, on="Student")

df_merge_col

   Student Class  Age  Score  id
0     Anna     A   15     80   1
1      Bob     A   15     82   2
2     Cass     B   16     95   3
3   Darius     A   17     70   4
4   Eugene     B   15     67   5
5   Felica     B   18     98   6
6   Gordon     B   15     85   7
7  Charlie     C   16     95   8
8    James     C   17     77   9
9    Ethan     C   18     80  10

Pivoting in Pandas

In [ ]:
import pandas as pd
student1 = ["Anna","Bob","Cass","Darius","Eugene","Felica","Gordon"]
classroom1 = ["A","A","B","A","B","B","B"]
age1 = [15,15,16,17,15,18,15]
score1 =  [80,82,95,70,67,98,85]
data1 = {"Student": student1, "Class":classroom1, "Age": age1,"Score": score1}
df1 = pd.DataFrame(data1,columns = ['Student', 'Class', 'Age', 'Score'])

student2 = ["Charlie","James","Ethan"]
classroom2 = ["C","C","C"]
age2 = [16,17,18]
score2 = [95,77,80]
data2 = {"Student": student2, "Class":classroom2, "Age": age2,"Score": score2}
df2 = pd.DataFrame(data2, columns = ['Student', 'Class', 'Age', 'Score'])

df_row = pd.concat([df1, df2], ignore_index=True)
student3 = ["Anna","Bob","Cass","Darius","Eugene","Felica","Gordon","Charlie","James","Ethan"]
id3 = [1,2,3,4,5,6,7,8,9,10]

data3 = {"Student":student3, "id":id3}
df3 = pd.DataFrame(data3,columns = ['Student', 'id'])

df_merge_col = pd.merge(df_row, df3, on="Student")

df_merge_col

df_merge_col.pivot_table(index="Class", columns="Age", values="Score")

Age    15  16  17  18
Class
A      81   0  70   0
B      76  95   0  98
C       0  95  77  80

Set Missing Values To 0

In [ ]:
import pandas as pd
student1 = ["Anna","Bob","Cass","Darius","Eugene","Felica","Gordon"]
classroom1 = ["A","A","B","A","B","B","B"]
age1 = [15,15,16,17,15,18,15]
score1 =  [80,82,95,70,67,98,85]
data1 = {"Student": student1, "Class":classroom1, "Age": age1,"Score": score1}
df1 = pd.DataFrame(data1,columns = ['Student', 'Class', 'Age', 'Score'])

student2 = ["Charlie","James","Ethan"]
classroom2 = ["C","C","C"]
age2 = [16,17,18]
score2 = [95,77,80]
data2 = {"Student": student2, "Class":classroom2, "Age": age2,"Score": score2}
df2 = pd.DataFrame(data2, columns = ['Student', 'Class', 'Age', 'Score'])

df_row = pd.concat([df1, df2], ignore_index=True)
student3 = ["Anna","Bob","Cass","Darius","Eugene","Felica","Gordon","Charlie","James","Ethan"]
id3 = [1,2,3,4,5,6,7,8,9,10]

data3 = {"Student":student3, "id":id3}
df3 = pd.DataFrame(data3,columns = ['Student', 'id'])

df_merge_col = pd.merge(df_row, df3, on="Student")

df_merge_col

df_merge_col.pivot_table(index="Class", columns="Age", values="Score", fill_value = 0)

Output DataFrame to csv

In [ ]:
df_merge_col.to_csv (r'df_merge_col.csv', index = False, header=True)